[
  {
    "title": "Is The Modi Government Trying To Spy On All Mobile Users? The Sanchar Saathi Controversy Explained",
    "category": "national",
    "summary": "A national debate has erupted after the government ordered Sanchar Saathi to be installed on every new smartphone sold in India. Critics call it a quiet attempt...",
    "date": "2025-12-02",
    "image": "Picsart_25-12-02_04-18-50-787.jpg",
    "filename": "is-the-modi-gov.html"
  },
  {
    "title": "Supreme Court Petition Filed Against Asaram’s Interim Bail by Minor Rape Survivor",
    "category": "crime",
    "summary": "The minor rape survivor filed a petition in the Supreme Court on December 1, 2025, seeking cancellation of the interim bails granted to Asaram by the Rajasthan...",
    "date": "2025-12-02",
    "image": "asrm1.jpg",
    "filename": "supreme-court-p.html"
  },
  {
    "title": "Rupee Hits All-Time Low of ₹89.41, Sparks Political Storm and Social Media Outrage",
    "category": "national",
    "summary": "The Indian rupee plunged to a historic low of ₹89.41 against the US dollar on November 27 and later recovered slightly to ₹89.22 to ₹89.23. The sharp fall, driv...",
    "date": "2025-12-02",
    "image": "rupeelow1.jpg",
    "filename": "rupee-hits-all.html"
  },
  {
    "title": "Odisha Assembly Elections 2024 - Comprehensive Expenditure Analysis",
    "category": "local",
    "summary": "The 2024 Odisha Assembly election expenditure affidavits reveal how political parties financed and executed their campaigns, offering an unprecedented look into...",
    "date": "2025-12-01",
    "image": "odisha-assembly.jpg",
    "filename": "odisha-assembly.html"
  },
  {
    "title": "Ganjam Village Electrified After 25 Years: Does This Contradict Modi’s 2018 100 Percent Electrification Claim",
    "category": "explainers",
    "summary": "Subarnapur, a remote village in Ganjam district, Odisha, has finally been electrified after 25 years of darkness.What began as a development update quickly became a political flashpoint, triggered primarily by...",
    "date": "2025-11-30",
    "image": "ganjam-village.jpg",
    "filename": "ganjam-village.html"
  },
  {
    "title": "Patanjali Fined for Substandard Ghee as Outrage Grows Over Delayed Action and Lenient Penalty",
    "category": "national",
    "summary": "A Uttarakhand court on November 27, 2025, fined Patanjali Ayurved ₹1 lakh after a 2020 sample of its desi cow ghee failed quality tests in two government labs. The ghee was declared substandard, and unfit for h...",
    "date": "2025-11-30",
    "image": "patanjali-fined.jpg",
    "filename": "patanjali-fined.html"
  },
  {
    "title": "Shree Siddhivinayak Ganapati Mandir: The Temple of Faith and Blessings",
    "category": "culture",
    "summary": "The Shree Siddhivinayak Ganapati Mandir in Mumbai is one of the most beloved and powerful temples dedicated to Lord Ganesha. Known for granting wishes and answering prayers, it attracts thousands of devotees ev...",
    "date": "2025-11-29",
    "image": "shree-siddhivin.jpg",
    "filename": "shree-siddhivin.html"
  }
]