[
  {
    "title": "Apple Denies Preloading Sanchar Saathi App.  AA major policy confrontation erupted after Apple declined to comply with the Indian government's confidential directive that required all smartphone makers to preload the Sanchar Saathi app on new devices sold in the country. The order, issued on November 28, 2025, instructed companies including Apple, Samsung, and Xiaomi to bundle the app within 90 days and ensure it could not be disabled or deleted by users. The mandate quickly triggered a wave of public criticism, opposition backlash, and concerns from digital rights groups who warned that such a requirement could erode privacy and open the door to surveillance.  Apple rejected the mandate on the grounds that it violates its core security and privacy principles. The company argued that its iOS ecosystem is built on a tightly controlled walled garden structure, and preloading a non-removable state app would require system-level permissions that Apple does not grant to third parties under any circumstances. Allowing such access, Apple said, would weaken device security, enlarge the attack surface, and undermine global standards the company maintains in all markets. The position is consistent with earlier instances where Apple resisted mandates viewed as infringing on user rights or compromising device integrity.  While other manufacturers like Samsung and Xiaomi appeared prepared to comply with the directive, Apple communicated its objections through private channels and signaled that it would not alter its operating system safeguards to satisfy the order. As the news spread, a significant public outcry followed, with social media debates erupting over fears that a non-removable government app could track calls, monitor user activity, or serve as a surveillance tool. The Opposition demanded parliamentary scrutiny, accused the government of forcing a snooping app onto citizens, and called for an immediate rollback.  Amid mounting criticism and political heat, the government began shifting its position. On December 2, 2025, Union Telecom Minister Jyotiraditya Scindia issued a clarification that effectively amounted to a U turn. He stated that Sanchar Saathi is optional for users, can be uninstalled at any time, and does not collect or monitor personal data. Scindia insisted that the government's intention behind preloading the app was purely to increase awareness about telecom cybersecurity, fraud detection, and assistance in reporting lost or stolen phones. He assured citizens that the app poses no threat to privacy and that registering on it is voluntary.  The minister also highlighted that the Sanchar Saathi initiative had already helped block millions of fraudulent mobile connections and prevented widespread misuse of SIM cards. He reiterated that the government's objective is to enhance digital safety rather than impose restrictions on users. Following the clarification, officials emphasized that users would remain fully in control of whether they want to keep or delete the app.  However, even with the U turn, Apple is expected to maintain its stance that any requirement to preload apps, even deletable ones, contradicts core iOS principles by installing software without the user's explicit consent. Apple is likely to continue private discussions with the government while firmly protecting its ecosystem norms.  As consultations between the government and smartphone manufacturers continue, the episode underscores the growing tensions between tech companies, user privacy concerns, and state digital policy. For now, Apple has refused to preload Sanchar Saathi, public and political pressure has forced the government to soften its mandate, and the issue remains a focal point in the ongoing debate over digital rights and security in India.s Public and Opposition Pressure Mount, Government Takes U Turn",
    "category": "national",
    "summary": "A major policy confrontation erupted after Apple declined to comply with the Indian government's confidential directive that required all smartphone makers to p...",
    "date": "2025-12-02",
    "timestamp": 1764694693588,
    "image": "sansa1.jpg",
    "filename": "apple-denies-pr.html"
  },
  {
    "title": "Viral Video Claims Chinese Robot Deployed on Ladakh Border, No Official confirmation yet",
    "category": "national",
    "summary": "A 34 second video circulating widely on social media has reignited tensions along the India China border, showing what some claim is a Chinese surveillance robo...",
    "date": "2025-12-02",
    "timestamp": 1764664920157,
    "image": "chro1.jpg",
    "filename": "viral-video-cla.html"
  },
  {
    "title": "Odisha Police Register FIR Against YouTuber Shubhankar Mishra for Spreading False Story on Jagannath Temple",
    "category": "national",
    "summary": "The Odisha Police have registered an FIR against popular YouTuber and journalist Shubhankar Mishra at the Singhadwar Police Station in Puri for allegedly spread...",
    "date": "2025-12-02",
    "timestamp": 1764660812011,
    "image": "sumis1.jpg",
    "filename": "odisha-police-r.html"
  },
  {
    "title": "Supreme Court Petition Filed Against Asaram’s Interim Bail by Minor Rape Survivor",
    "category": "crime",
    "summary": "The minor rape survivor filed a petition in the Supreme Court on December 1, 2025, seeking cancellation of the interim bails granted to Asaram by the Rajasthan...",
    "date": "2025-12-02",
    "timestamp": 7,
    "image": "asrm1.jpg",
    "filename": "supreme-court-p.html"
  },
  {
    "title": "Rupee Hits All-Time Low of ₹89.41, Sparks Political Storm and Social Media Outrage",
    "category": "national",
    "summary": "The Indian rupee plunged to a historic low of ₹89.41 against the US dollar on November 27 and later recovered slightly to ₹89.22 to ₹89.23. The sharp fall, driv...",
    "date": "2025-12-02",
    "timestamp": 6,
    "image": "rupeelow1.jpg",
    "filename": "rupee-hits-all.html"
  },
  {
    "title": "Is The Modi Government Trying To Spy On All Mobile Users? The Sanchar Saathi Controversy Explained",
    "category": "national",
    "summary": "A national debate has erupted after the government ordered Sanchar Saathi to be installed on every new smartphone sold in India. Critics call it a quiet attempt...",
    "date": "2025-12-02",
    "timestamp": 5,
    "image": "Picsart_25-12-02_04-18-50-787.jpg",
    "filename": "is-the-modi-gov.html"
  },
  {
    "title": "Odisha Assembly Elections 2024 - Comprehensive Expenditure Analysis",
    "category": "local",
    "summary": "The 2024 Odisha Assembly election expenditure affidavits reveal how political parties financed and executed their campaigns, offering an unprecedented look into...",
    "date": "2025-12-01",
    "timestamp": 4,
    "image": "odisha-assembly.jpg",
    "filename": "odisha-assembly.html"
  },
  {
    "title": "Ganjam Village Electrified After 25 Years: Does This Contradict Modi’s 2018 100 Percent Electrification Claim",
    "category": "explainers",
    "summary": "Subarnapur, a remote village in Ganjam district, Odisha, has finally been electrified after 25 years of darkness.What began as a development update quickly became a political flashpoint, triggered primarily by...",
    "date": "2025-11-30",
    "timestamp": 3,
    "image": "ganjam-village.jpg",
    "filename": "ganjam-village.html"
  },
  {
    "title": "Patanjali Fined for Substandard Ghee as Outrage Grows Over Delayed Action and Lenient Penalty",
    "category": "national",
    "summary": "A Uttarakhand court on November 27, 2025, fined Patanjali Ayurved ₹1 lakh after a 2020 sample of its desi cow ghee failed quality tests in two government labs. The ghee was declared substandard, and unfit for h...",
    "date": "2025-11-30",
    "timestamp": 2,
    "image": "patanjali-fined.jpg",
    "filename": "patanjali-fined.html"
  },
  {
    "title": "Shree Siddhivinayak Ganapati Mandir: The Temple of Faith and Blessings",
    "category": "culture",
    "summary": "The Shree Siddhivinayak Ganapati Mandir in Mumbai is one of the most beloved and powerful temples dedicated to Lord Ganesha. Known for granting wishes and answering prayers, it attracts thousands of devotees ev...",
    "date": "2025-11-29",
    "timestamp": 1,
    "image": "shree-siddhivin.jpg",
    "filename": "shree-siddhivin.html"
  }
]